/*******************************************************/ 
/*           Лаборатордук иш                           */ 
/*          Берилиштердин типтери жана киргизүү/чыгаруу */ 
/*******************************************************/ 
#include <iostream>
#include <iomanip> 

using namespace std;

int main() {
    string name1 = "Bor";
    float zone1 = 1.1;
    int el1 = 10;
    int hole1 = 10;

    string name2 = "Telur";
    float zone2 = 0.36;
    int el2 = 1700;
    int hole2 = 1200;

    string name3 = "CdTe";
    float zone3 = 1.45;
    int el3 = 450;
    int hole3 = 100;

   
    cout << fixed << setprecision(2);

    cout << "-------------------------------------------------------------\n";
    cout << "|              Жарым өткөргүчтөрдүн касиеттери              |\n";
    cout << "-------------------------------------------------------------\n";
    cout << "|    Зат    | Тыюу салынган | Электрондордун | Тешиктердин  |\n";
    cout << "|           |   зона (эВ)   |    кыймылы     |   кыймылы    |\n";
    cout << "------------|---------------|----------------|--------------|\n";

    cout << "| " << left  << setw(9)  << name1 
         << " | " << right << setw(13) << zone1 
         << " | " << right << setw(14) << el1 
         << " | " << right << setw(12) << hole1 << " |\n";

    cout << "| " << left  << setw(9)  << name2 
         << " | " << right << setw(13) << zone2 
         << " | " << right << setw(14) << el2 
         << " | " << right << setw(12) << hole2 << " |\n";

    cout << "| " << left  << setw(9)  << name3 
         << " | " << right << setw(13) << zone3 
         << " | " << right << setw(14) << el3 
         << " | " << right << setw(12) << hole3 << " |\n";

    cout << "-------------------------------------------------------------\n";
    cout << "| Тыюу салынган зона: эв; кыймыл: кв.см/сек*в               |\n";
    cout << "-------------------------------------------------------------\n";

    return 0;
}